//菜单
void Menu()
{
    //菜单
    printf("                                 宿舍管理系统\n\n");
    printf("*************************************菜单***************************************\n");
    printf(" 1.添加学生信息                       |   6.以宿舍号查询该寝室中的全部学生信息\n");
    printf(" 2.修改学生信息                       |   7.以班级号查询该班级中的全部学生信息\n");
    printf(" 3.删除学生信息                       |   8.显示所有学生的相关信息\n");
    printf(" 4.以姓名查询学生信息                 |   9.退出程序\n");
    printf(" 5.以学号查询学生信息                 |  \n");
    printf("********************************************************************************\n");
}